<a href="https://colab.research.google.com/github/werowe/HypatiaAcademy/blob/master/basics/sqllite_getting_started.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#SQL Lite 3


SQL Light is the world's most popular database.  It is designed to be very small.  It in in every iPhone and Android phone, for example.

We can use Python to work with it.  But even with Python the way we work with it is with SQL.  Below we show some of the most common SQL commands.



The [document is here](https://www.sqlite.org/lang.html)/

In [1]:
# load SQL command line interepreter

%load_ext sql

In [5]:
# create or connect to database

%sql sqlite:///students.db

In [6]:
# list files to show it was created

!ls

sample_data  students.db

In [13]:
%%sql

CREATE TABLE students
  (
    studentnumber INTEGER PRIMARY KEY AUTOINCREMENT,
    studentname text,
    phonenumber text,
    email text,
    datecreated text
  );

   sqlite:////students.db
 * sqlite:///students.db
Done.

[]

In [27]:
# add user to table.  Notice that we want the datecreated to be the current epoch time


%%sql

INSERT INTO students (studentname, phonenumber, email, datecreated)
VALUES ('William Shakespeare',"555-1212", "will@globe.uk.com", strftime('%s', 'now'));

   sqlite:////students.db
 * sqlite:///students.db
1 rows affected.

[]

In [26]:
%%sql


INSERT INTO students (studentname, phonenumber, email, datecreated)
VALUES ('Thomas Mann',"555-1212", "a@a.com", strftime('%s', 'now'));

   sqlite:////students.db
 * sqlite:///students.db
1 rows affected.

[]

In [28]:
# list rows in table
%%sql

select * from students;

   sqlite:////students.db
 * sqlite:///students.db
Done.

[(4, 'Thomas Mann', '555-1212', 'a@a.com', '1727595222'),
 (5, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727595225')]

In [21]:
# find by column value

%%sql

select * from students where email="a@a.com";

   sqlite:////students.db
 * sqlite:///students.db
Done.

[(3, 'Thomas Mann', '555-1212', 'a@a.com', '1727595074')]

In [25]:
# delete all rows in table
%%sql

delete from students;

   sqlite:////students.db
 * sqlite:///students.db
3 rows affected.

[]

In [30]:
# update data

%%sql

UPDATE students
SET studentname = "David Foster Wallace"
WHERE email = "a@a.com";

   sqlite:////students.db
 * sqlite:///students.db
1 rows affected.

[]

In [12]:
# delete whole table

%%sql

drop table students

   sqlite:////students.db
 * sqlite:///students.db
Done.

[]